{
    "D1-1": {
        "name": "Composante 1",
        "subtitle": "Comprendre, s’exprimer en utilisant la langue française à l’oral et à l’écrit",
        "significants": {
            "S’exprimer à l’oral": [
                "Être capable d’une prise de parole continue d’une durée variable selon les types de  discours (de cinq à dix minutes au maximum, si le propos croise narration, description, opinion et argumentation; moins s’il s’agit d’une seule de ces composantes), avec quelques relances de la part du professeur si nécessaire;",
                "Pouvoir exprimer une impression, un avis, une opinion de manière raisonnée, en respectant les formes d’un oral codifié et socialisé;",
                "Savoir faire preuve d’une relative liberté dans sa prise de parole par rapport à ses notes de préparation."
            ],
            "Comprendre des énoncés oraux": [
                "Reformuler le sens général d’un discours oral découvert de manière autonome et adapté par ses références et son niveau de langue aux connaissances définies par les programmes",
                "Rendre compte de la teneur générale de discours oraux complexes (conversations, débats)."
            ],
            "Lire et comprendre l’écrit": [
                "Proposer sa compréhension d’un texte inconnu d’environ trente lignes ou d’un document associant image et énoncé écrit, en s’appuyant sur des éléments d’analyse précis et en mobilisant ses connaissances linguistiques et culturelles ;",
                "Proposer un compte rendu de ce qu’il retient de la lecture d’une œuvre et la mise en évidence de l’essentiel d’un texte long."
            ],
            "Écrire": [
                "Être capable de réponses écrites développées et argumentées à des questions de compréhension et d’analyse d’un texte et/ou d’une image;",
                "Savoir écrire un texte pouvant aller jusqu’à 2000 à 3000 signes dans une langue globalement correcte, en cohérence avec les attendus en étude de la langue, et suffisamment riche pour lui permettre de produire un texte d’invention, intéressant et conforme à l’énoncé de l’exercice, ou d’exprimer sa pensée de manière  argumentée et nuancée;",
                "Produire un texte rédigé dans une langue suffisamment maîtrisée pour que son intelligibilité ne soit pas compromise;",
                "Réinvestir le vocabulaire spécialisé à bon escient."
            ],
            "Exploiter les ressources de la langue": [
                "Réfléchir sur le système linguistique",
                "Mobiliser les connaissances et procédures orthographiques et syntaxiques étudiées pour produire un texte pouvant aller jusqu’à 2000 à 3000 signes dans une langue globalement correcte;",
                "Réviser un énoncé produit par lui-même ou un autre scripteur à partir d’indications orientant cette révision;",
                "Savoir analyser en contexte des unités lexicales en les mettant en relation et en se fondant sur l’analyse de leur forme;",
                "Savoir analyser les propriétés d’un ou de plusieurs éléments linguistiques en les référant au système de la langue et en les comparant éventuellement au système d’une autre langue."
            ]
        }
    },
    "D1-3": {
        "nom": "Composante 3",
        "subtitle": "Comprendre, s’exprimer en utilisant les langages mathématiques, scientifiques et informatiques ",
        "significants": {
            "Utiliser les nombres": [
                "Comprendre et utiliser les notions de divisibilité et de nombre premier.",
                "Effectuer (mentalement, à la main, à la calculatrice, à l’aide d’un tableur) des calculs engageant les quatre opérations et des comparaisons sur des nombres rationnels positifs ou négatifs.",
                "Effectuer des calculs numériques impliquant des puissances.",
                "Passer d’une écriture d’un nombre à une autre (écritures décimale et fractionnaire, notation scientifique, pourcentages).",
                "Comprendre et utiliser la notion de racine carrée.",
                "Repérer un nombre sur une droite graduée.",
                "Reconnaître et résoudre une situation de proportionnalité."
            ],
            "Utiliser le calcul littéral": [
                "Développer et factoriser des expressions littérales dans des cas très simples.",
                "Citer et utiliser une expression littérale, notamment pour exprimer une grandeur en fonction d’autres grandeurs.",
                "Produire une expression littérale.",
                "Dans une expression littérale, substituer une lettre par une valeur numérique, en utilisant si nécessaire les unités adaptées.",
                "Mettre un problème simple en équation.",
                "Résoudre des équations ou des inéquations du premier degré."
            ],
            "Exprimer une grandeur mesurée ou calculée dans une unité adaptée": [
                "Accompagner de son unité toute valeur numérique d’une grandeur physique mesurée, calculée ou fournie.",
                "Utiliser, dans les calculs numériques, un système d’unités cohérent."
            ],
            "Passer d’un langage à un autre": [
                "Passer du langage courant à un langage scientifique ou technique et vice versa.",
                "Passer d’un registre de représentation à un autre (tableau, graphique, croquis, symbole, schéma, etc.).",
                "Exploiter, dans des situations simples, les différences (complémentarité, redondance, complexité, etc.) entre différents registres de représentation"
            ],
            "Utiliser le langage des probabilités": [
                "Utiliser le vocabulaire lié aux notions élémentaires de probabilités : - calculer des probabilités dans un contexte simple; - faire le lien entre fréquence et probabilité; - simuler une expérience aléatoire."
            ],
            "Utiliser et produire des représentations d’objets": [
                "Utiliser et produire des figures géométriques.",
                "Lire des plans et des cartes.",
                "Se repérer sur des cartes à différentes échelles.",
                "Utiliser le langage cartographique pour réaliser une production graphique.",
                "Comprendre l’effet de quelques transformations (déplacements, agrandissements-réductions) sur des grandeurs géométriques.",
                "Se repérer sur une droite graduée, dans le plan muni d’un repère orthogonal, dans un parallélépipède rectangle, sur une sphère.",
                "Utiliser et produire des représentations de solides.",
                "Lire, interpréter et produire des tableaux, des graphiques, des diagrammes.",
                "Utiliser des indicateurs statistiques."
            ],
            "Utiliser l’algorithmique et la programmation pour créer des applications simples": [
                "Expliquer le déroulement et le résultat produit par un algorithme simple.",
                "Écrire un algorithme ou un programme qui permet une interaction avec l’utilisateur ou entre les objets qu’il utilise, en réponse à un problème donné.",
                "Mettre au point un programme pour corriger une erreur ou apporter une amélioration.",
                "Implanter et tester un programme dans un système réel pour imposer un comportement."
            ]
        }
    },
    "D2": {
        "name": "Domaine 2",
        "subtitle": "Les méthodes et outils pour apprendre",
        "significants": {
            "Organiser son travail personnel": [
                "Choisir et utiliser différents outils et techniques pour garder la trace de ses activités et/ou recherches et permettre un entraînement au travers d’un travail personnel.",
                "Planifier les étapes et les tâches pour la réalisation d’une production."
            ],
            "Coopérer et réaliser des projets": [
                "Définir et respecter une organisation et un partage des tâches dans le cadre d’un travail de groupe."
            ],
            "Rechercher et traiter l’information et s’initier aux langages des médias": [
                "Rechercher des informations dans différents médias (presse écrite, audiovisuelle, web) et ressources documentaires.",
                "Apprécier la fiabilité des informations recueillies en croisant différentes sources."
            ],
            "Mobiliser des outils numériques pour apprendre, échanger, communiquer": [
                "Utiliser des outils numériques pour réaliser une production (scientifique, artistique, motrice, expérimentale, document multimédia…).",
                "Utiliser des outils numériques pour analyser des données ou une production (orale, artistique, motrice, technologique, etc.).",
                "Utiliser des outils et espaces numériques pour échanger, stocker, mutualiser des informations."
            ]
        }
    },
    "D3": {
        "name": "Domaine 3",
        "subtitle": "La formation de la personne et du citoyen",
        "significants": {
            "Maîtriser l’expression de sa sensibilité et de ses opinions, respecter celles des autres": [
                "Expliciter les émotions ressenties.",
                "Formuler une opinion, prendre de la distance avec celle-ci, la confronter à celle d’autrui et en discuter."
            ],
            "Connaître et comprendre la règle et le droit": [
                "S’approprier et respecter les règles de fonctionnement de son établissement et de collectifs plus restreints, et participer à leur élaboration.",
                "Connaître, comprendre et analyser les principes, les valeurs et les symboles de la République française et des sociétés démocratiques."
            ],
            "Exercer son esprit critique, faire preuve de réflexion et de discernement": [
                "Rendre compte des argumentaires développés par différents protagonistes relativement à une thématique.",
                "Utiliser les médias et l’information de manière responsable et raisonnée.",
                "Distinguer ce qui relève d’une croyance ou d’une opinion et ce qui constitue un savoir (ou un fait) scientifique.",
                "Distinguer la perception subjective de l’analyse objective."
            ],
            "Faire preuve de responsabilité, respecter les règles de la vie collective, s’engager et prendre des initiatives": [
                "Assumer des responsabilités et prendre des initiatives dans l’établissement et/ou dans la classe.",
                "S’impliquer dans la mise en place d’un événement dans l’établissement."
            ]
        }
    },
    "D4": {
        "name": "Domaine 4",
        "subtitle": "Systèmes naturels et systèmes techniques",
        "significants": {
            "Mener une démarche scientifique, résoudre un problème": [
                "Modéliser et représenter des phénomènes et des objets.",
                "Mettre en œuvre un protocole expérimental, réaliser le prototype d’un objet.",
                "Pratiquer le calcul numérique (exact et approché) et le calcul littéral.",
                "Contrôler la vraisemblance d’un résultat.",
                "Communiquer sur ses démarches, ses résultats et ses choix, en argumentant"
            ],
            "Concevoir des objets et systèmes techniques": [
                "Concevoir des objets simples, des éléments de programme informatique, des protocoles biotechnologiques en réponse à un besoin."
            ]
        }
    },
    "D5": {
        "name": "Domaine 5",
        "subtitle": "Représentation du monde",
        "significants": {
            "Situer et se situer dans le temps et l’espace": [
                "Maîtriser de manière autonome des repères dans le temps :<br> - connaître et localiser dans le temps de grandes périodes historiques, des phénomènes historiques, des faits et des événements, des mouvements intellectuels, artistiques et culturels;<br> - situer et ordonner des faits dans le temps ; pratiquer de conscients allers-retours dans la chronologie, maîtriser la chronologie narrative, savoir ordonner un récit.",
                "Maîtriser de manière autonome des repères dans l’espace :<br> - connaître et localiser des repères spatiaux aux différentes échelles et sur des projections cartographiques variées ;<br> - se repérer et repérer des lieux dans l’espace en utilisant des plans, des cartes et des outils de géolocalisation ;<br> - situer et mettre en relation des lieux et des espaces à partir de cartes d’échelles et de projection variées et d’images.",
                "Contextualiser un document, un texte, une œuvre, un(e) artiste, un personnage, une découverte scientifique, un fait artistique ou une notion dans le temps et dans une ou plusieurs aires géographiques et culturelles."
            ]
        }
    },
    "Co" : {
        "name": "Compétences",
        "subtitle": "Chercher,...",
        "significants": {
            "Chercher" : [
                "Chercher est peut-être la première des compétences à laquelle on pense lorsqu’on tente de décrire l’activité mathématique. Elle en constitue sans doute la part la plus exaltante pour celles et ceux qui aiment les mathématiques. Mais aussi la part la plus difficile pour d’autres. Il faut reconnaitre qu’il s’agit de l’une des compétences qui se laissent le moins facilement circonscrire. Amener les élèves à savoir quoi chercher et comment chercher est donc un objectif ambitieux, mais nécessaire au développement de toutes les autres compétences au cycle 4."
            ],
            "Modéliser" : [
                "La compétence « Modéliser », si on la prend dans son acception la plus large, renvoie pour le mathématicien au fait d’utiliser un ensemble de concepts, de méthodes, de théories mathématiques qui vont permettre de décrire, comprendre et prévoir l’évolution de phénomènes externes aux mathématiques."
            ],
            "Représenter" : [
                "Le développement de la compétence « Représenter » au cycle 4 doit à la fois permettre à l’élève de progresser dans la vision du réel et dans l’appréhension des objets mathématiques abstraits. Comprendre ce qu’est un triangle, ce qu’est une fonction, ce qu’est une fraction, c’est savoir « représenter » ces objets, c’est-à-dire trouver un registre de représentation adéquat, mais aussi savoir varier les représentations et les registres de représentation. Un élève capable de convoquer dans un exercice mettant en jeu une fonction un graphique, un tableau de nombres, une écriture symbolique, est en train de s’approprier la notion de fonction. Dans cet exercice, on voit que la représentation est aussi pensée de manière dynamique, dans sa capacité à engendrer d’autres représentations, à l’intérieur d’un même registre ou dans un autre registre."
            ],
            "Raisonner" : [
                "Le programme de mathématiques du cycle 4 offre une place de choix à la compétence « raisonner » dans laquelle il regroupe les démarches suivantes :<br>• résoudre des problèmes impliquant des grandeurs variées (géométriques, physiques, économiques) : mobiliser les connaissances nécessaires, analyser et exploiter ses erreurs, mettre à l’essai plusieurs solutions ;<br>• mener collectivement une investigation en sachant prendre en compte le point de vue d’autrui ;<br>• démontrer : utiliser un raisonnement logique et des règles établies (propriétés, théorèmes, formules) pour parvenir à une conclusion ;<br>• fonder et défendre ses jugements en s’appuyant sur des résultats établis et sur sa maîtrise de l’argumentation."
            ],
            "Calculer" : [
                "La pratique du calcul doit viser un double équilibre : d’une part entre automatisation et raisonnement, d’autre part entre une visée pragmatique (l’obtention d’un résultat) et un accès à la compréhension des objets mathématiques engagés dans le calcul (nombres, symboles, etc.). Par ailleurs, le développement des technologies informatiques a profondément modifié l’appréhension du calcul, tant au niveau des pratiques quotidiennes et sociales qu’à celui des pratiques scientifiques. D’une part, la plupart des algorithmes de calcul dont l’apprentissage occupait autrefois un temps important de la scolarité obligatoire sont aujourd’hui implémentés dans les calculatrices les plus simples, ce qui pose la question de la pertinence du maintien de leur enseignement, d’autre part la puissance de calcul des nouveaux outils modifie profondément l’économie du calcul et pose dans des termes renouvelés celle de la gestion des rapports entre le calcul et le raisonnement puisqu’elle favorise explorations, simulations et expérimentations préalables à la découverte de preuves."
            ],
            "Communiquer" : [
                "Communiquer efficacement dans le cadre d’une activité mathématique est un objectif de formation essentiel, recouvrant plusieurs champs de compétences : comprendre des énoncés, produire des textes aux finalités diverses, s’exprimer oralement.<br> C’est aussi par la médiation d’échanges que le professeur apprécie le niveau de maîtrise de l’élève. Cette double fonction de la communication, objet de formation et moyen d’apprécier la réussite de l’élève, a son importance. S’il convient que l’élève apprenne à s’exprimer avec un maximum de rigueur et de clarté, il ne faut pas pour autant considérer que celui qui s’exprime avec peine a nécessairement des difficultés mathématiques. Il s’agit avant tout d’ouvrir le champ de la résolution de problèmes au plus grand nombre d’élèves, y compris à ceux qui ont des difficultés à entrer dans les codes de la rédaction d’une démonstration."
            ]
        }
    }
}
